Revit 2024 API
BuiltInFailures.DPartFailures.SourceInUnloadedLink Property
 Some elements already have parts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SourceInUnloadedLink { get; }
Visual Basic
Public Shared ReadOnly Property SourceInUnloadedLink As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SourceInUnloadedLink {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace